  "transform_params" : {
    "input_data__0" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.0039215688593685627
    }
  },
  "properties" : {
  },
  "storage" : "model.espresso.weights",
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/Conv\/Relu:0",
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "MobilePSPNet\/MobilenetV2\/Conv\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "input_data__0",
      "weights" : {
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv\/depthwise\/Relu:0",
      "K" : 48,
      "blob_biases" : 5,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "MobilePSPNet\/MobilenetV2\/Conv\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 48,
      "blob_biases" : 9,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_1\/expand\/Relu:0",
      "K" : 24,
      "blob_biases" : 13,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_1\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv\/project\/BatchNorm\/batchnorm\/add_1:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu:0",
      "K" : 144,
      "blob_biases" : 17,
      "stride_x" : 2,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_1\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_1\/expand\/Relu:0",
      "weights" : {
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_1\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 144,
      "blob_biases" : 21,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_1\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_2\/expand\/Relu:0",
      "K" : 32,
      "blob_biases" : 25,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_2\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_1\/project\/BatchNorm\/batchnorm\/add_1:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu:0",
      "K" : 192,
      "blob_biases" : 29,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_2\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_2\/expand\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_2\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 192,
      "blob_biases" : 33,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_2\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 35
    },
    {
      "alpha" : 1,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_2\/project\/BatchNorm\/batchnorm\/add_1:0,MobilePSPNet\/MobilenetV2\/expanded_conv_1\/project\/BatchNorm\/batchnorm\/add_1:0",
      "operation" : 0,
      "weights" : {
      },
      "fused_relu" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_2\/add:0",
      "type" : "elementwise",
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_2\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_3\/expand\/Relu:0",
      "K" : 32,
      "blob_biases" : 37,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_3\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_2\/add:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 39
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu:0",
      "K" : 192,
      "blob_biases" : 41,
      "stride_x" : 2,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_3\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_3\/expand\/Relu:0",
      "weights" : {
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_3\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 192,
      "blob_biases" : 45,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_3\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_4\/expand\/Relu:0",
      "K" : 48,
      "blob_biases" : 49,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_4\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_3\/project\/BatchNorm\/batchnorm\/add_1:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu:0",
      "K" : 288,
      "blob_biases" : 53,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_4\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_4\/expand\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 55
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_4\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 288,
      "blob_biases" : 57,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_4\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "alpha" : 1,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_4\/project\/BatchNorm\/batchnorm\/add_1:0,MobilePSPNet\/MobilenetV2\/expanded_conv_3\/project\/BatchNorm\/batchnorm\/add_1:0",
      "operation" : 0,
      "weights" : {
      },
      "fused_relu" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_4\/add:0",
      "type" : "elementwise",
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_4\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_5\/expand\/Relu:0",
      "K" : 48,
      "blob_biases" : 61,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_5\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_4\/add:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_5\/depthwise\/Relu:0",
      "K" : 288,
      "blob_biases" : 65,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_5\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_5\/expand\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 2,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 2,
      "blob_weights_f16" : 67
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_5\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 288,
      "blob_biases" : 69,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_5\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_5\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 71
    },
    {
      "alpha" : 1,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_5\/project\/BatchNorm\/batchnorm\/add_1:0,MobilePSPNet\/MobilenetV2\/expanded_conv_4\/add:0",
      "operation" : 0,
      "weights" : {
      },
      "fused_relu" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_5\/add:0",
      "type" : "elementwise",
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_5\/add:0",
      "beta" : 0
    },
    {
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_5\/add:0",
      "scaling_factor_y" : 2,
      "weights" : {
      },
      "mode" : 1,
      "top" : "MobilePSPNet\/decoder\/ResizeBilinear_10:0",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "MobilePSPNet\/decoder\/ResizeBilinear_10:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_6\/expand\/Relu:0",
      "K" : 48,
      "blob_biases" : 73,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_6\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_5\/add:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 75
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_6\/depthwise\/Relu:0",
      "K" : 288,
      "blob_biases" : 77,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_6\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_6\/expand\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 2,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 2,
      "blob_weights_f16" : 79
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_6\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 288,
      "blob_biases" : 81,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_6\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 88,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_6\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 83
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_7\/expand\/Relu:0",
      "K" : 88,
      "blob_biases" : 85,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_7\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_6\/project\/BatchNorm\/batchnorm\/add_1:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 87
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_7\/depthwise\/Relu:0",
      "K" : 528,
      "blob_biases" : 89,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_7\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 528,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_7\/expand\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 2,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 2,
      "blob_weights_f16" : 91
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_7\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 528,
      "blob_biases" : 93,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_7\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 88,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_7\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 95
    },
    {
      "alpha" : 1,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_7\/project\/BatchNorm\/batchnorm\/add_1:0,MobilePSPNet\/MobilenetV2\/expanded_conv_6\/project\/BatchNorm\/batchnorm\/add_1:0",
      "operation" : 0,
      "weights" : {
      },
      "fused_relu" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_7\/add:0",
      "type" : "elementwise",
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_7\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_8\/expand\/Relu:0",
      "K" : 88,
      "blob_biases" : 97,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_8\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_7\/add:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 99
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_8\/depthwise\/Relu:0",
      "K" : 528,
      "blob_biases" : 101,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_8\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 528,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_8\/expand\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 2,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 2,
      "blob_weights_f16" : 103
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_8\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 528,
      "blob_biases" : 105,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_8\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 88,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_8\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 107
    },
    {
      "alpha" : 1,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_8\/project\/BatchNorm\/batchnorm\/add_1:0,MobilePSPNet\/MobilenetV2\/expanded_conv_7\/add:0",
      "operation" : 0,
      "weights" : {
      },
      "fused_relu" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_8\/add:0",
      "type" : "elementwise",
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_8\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_9\/expand\/Relu:0",
      "K" : 88,
      "blob_biases" : 109,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_9\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_8\/add:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 111
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_9\/depthwise\/Relu:0",
      "K" : 528,
      "blob_biases" : 113,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_9\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 528,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_9\/expand\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 2,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 2,
      "blob_weights_f16" : 115
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_9\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 528,
      "blob_biases" : 117,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_9\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 88,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_9\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 119
    },
    {
      "alpha" : 1,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_9\/project\/BatchNorm\/batchnorm\/add_1:0,MobilePSPNet\/MobilenetV2\/expanded_conv_8\/add:0",
      "operation" : 0,
      "weights" : {
      },
      "fused_relu" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_9\/add:0",
      "type" : "elementwise",
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_9\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_10\/expand\/Relu:0",
      "K" : 88,
      "blob_biases" : 121,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_10\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_9\/add:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 123
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_10\/depthwise\/Relu:0",
      "K" : 528,
      "blob_biases" : 125,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_10\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 528,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_10\/expand\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 2,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 2,
      "blob_weights_f16" : 127
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_10\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 528,
      "blob_biases" : 129,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_10\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 136,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_10\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 131
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_11\/expand\/Relu:0",
      "K" : 136,
      "blob_biases" : 133,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_11\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 816,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_10\/project\/BatchNorm\/batchnorm\/add_1:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 135
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_11\/depthwise\/Relu:0",
      "K" : 816,
      "blob_biases" : 137,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_11\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 816,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 816,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_11\/expand\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 2,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 2,
      "blob_weights_f16" : 139
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_11\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 816,
      "blob_biases" : 141,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_11\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 136,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_11\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 143
    },
    {
      "alpha" : 1,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_11\/project\/BatchNorm\/batchnorm\/add_1:0,MobilePSPNet\/MobilenetV2\/expanded_conv_10\/project\/BatchNorm\/batchnorm\/add_1:0",
      "operation" : 0,
      "weights" : {
      },
      "fused_relu" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_11\/add:0",
      "type" : "elementwise",
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_11\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_12\/expand\/Relu:0",
      "K" : 136,
      "blob_biases" : 145,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_12\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 816,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_11\/add:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 147
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_12\/depthwise\/Relu:0",
      "K" : 816,
      "blob_biases" : 149,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_12\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 816,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 816,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_12\/expand\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 2,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 2,
      "blob_weights_f16" : 151
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_12\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 816,
      "blob_biases" : 153,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_12\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 136,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_12\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 155
    },
    {
      "alpha" : 1,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_12\/project\/BatchNorm\/batchnorm\/add_1:0,MobilePSPNet\/MobilenetV2\/expanded_conv_11\/add:0",
      "operation" : 0,
      "weights" : {
      },
      "fused_relu" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_12\/add:0",
      "type" : "elementwise",
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_12\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_13\/expand\/Relu:0",
      "K" : 136,
      "blob_biases" : 157,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_13\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 816,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_12\/add:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 159
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_13\/depthwise\/Relu:0",
      "K" : 816,
      "blob_biases" : 161,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_13\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 816,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 816,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_13\/expand\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 2,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 2,
      "blob_weights_f16" : 163
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_13\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 816,
      "blob_biases" : 165,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_13\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 224,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_13\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 167
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_14\/expand\/Relu:0",
      "K" : 224,
      "blob_biases" : 169,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_14\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1344,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_13\/project\/BatchNorm\/batchnorm\/add_1:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 171
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_14\/depthwise\/Relu:0",
      "K" : 1344,
      "blob_biases" : 173,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_14\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1344,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 1344,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_14\/expand\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 2,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 2,
      "blob_weights_f16" : 175
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_14\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 1344,
      "blob_biases" : 177,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_14\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 224,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_14\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 179
    },
    {
      "alpha" : 1,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_14\/project\/BatchNorm\/batchnorm\/add_1:0,MobilePSPNet\/MobilenetV2\/expanded_conv_13\/project\/BatchNorm\/batchnorm\/add_1:0",
      "operation" : 0,
      "weights" : {
      },
      "fused_relu" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_14\/add:0",
      "type" : "elementwise",
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_14\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_15\/expand\/Relu:0",
      "K" : 224,
      "blob_biases" : 181,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_15\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1344,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_14\/add:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 183
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_15\/depthwise\/Relu:0",
      "K" : 1344,
      "blob_biases" : 185,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_15\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1344,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 1344,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_15\/expand\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 2,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 2,
      "blob_weights_f16" : 187
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_15\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 1344,
      "blob_biases" : 189,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_15\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 224,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_15\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 191
    },
    {
      "alpha" : 1,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_15\/project\/BatchNorm\/batchnorm\/add_1:0,MobilePSPNet\/MobilenetV2\/expanded_conv_14\/add:0",
      "operation" : 0,
      "weights" : {
      },
      "fused_relu" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_15\/add:0",
      "type" : "elementwise",
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_15\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_16\/expand\/Relu:0",
      "K" : 224,
      "blob_biases" : 193,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_16\/expand\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1344,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_15\/add:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 195
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_16\/depthwise\/Relu:0",
      "K" : 1344,
      "blob_biases" : 197,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_16\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1344,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 1344,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_16\/expand\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 0,
      "Nx" : 3,
      "dilation_x" : 2,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "dilation_y" : 2,
      "blob_weights_f16" : 199
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/MobilenetV2\/expanded_conv_16\/project\/BatchNorm\/batchnorm\/add_1:0",
      "K" : 1344,
      "blob_biases" : 201,
      "name" : "MobilePSPNet\/MobilenetV2\/expanded_conv_16\/project\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 448,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_16\/depthwise\/Relu:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 203
    },
    {
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_16\/project\/BatchNorm\/batchnorm\/add_1:0",
      "scaling_factor_y" : 2,
      "weights" : {
      },
      "mode" : 1,
      "top" : "MobilePSPNet\/decoder\/ResizeBilinear_9:0",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "MobilePSPNet\/decoder\/ResizeBilinear_9:0"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 0,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {
      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "MobilePSPNet\/MobilenetV2\/expanded_conv_16\/project\/BatchNorm\/batchnorm\/add_1:0",
      "pad_l" : 0,
      "name" : "MobilePSPNet\/decoder\/avg_pool_1\/AvgPool:0",
      "top" : "MobilePSPNet\/decoder\/avg_pool_1\/AvgPool:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/decoder\/conv4\/Relu:0",
      "K" : 448,
      "blob_biases" : 205,
      "name" : "MobilePSPNet\/decoder\/conv4\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "MobilePSPNet\/decoder\/avg_pool_1\/AvgPool:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 207
    },
    {
      "bottom" : "MobilePSPNet\/decoder\/conv4\/Relu:0",
      "scaling_factor_y" : 2,
      "weights" : {
      },
      "mode" : 1,
      "top" : "MobilePSPNet\/decoder\/ResizeBilinear_7:0",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "MobilePSPNet\/decoder\/ResizeBilinear_7:0"
    },
    {
      "bottom" : "MobilePSPNet\/decoder\/ResizeBilinear_7:0",
      "scaling_factor_y" : 2,
      "weights" : {
      },
      "mode" : 1,
      "top" : "MobilePSPNet\/decoder\/ResizeBilinear_8:0",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "MobilePSPNet\/decoder\/ResizeBilinear_8:0"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 0,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {
      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "MobilePSPNet\/decoder\/avg_pool_1\/AvgPool:0",
      "pad_l" : 0,
      "name" : "MobilePSPNet\/decoder\/avg_pool_2\/AvgPool:0",
      "top" : "MobilePSPNet\/decoder\/avg_pool_2\/AvgPool:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/decoder\/conv3\/Relu:0",
      "K" : 448,
      "blob_biases" : 209,
      "name" : "MobilePSPNet\/decoder\/conv3\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "MobilePSPNet\/decoder\/avg_pool_2\/AvgPool:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 211
    },
    {
      "bottom" : "MobilePSPNet\/decoder\/conv3\/Relu:0",
      "scaling_factor_y" : 2,
      "weights" : {
      },
      "mode" : 1,
      "top" : "MobilePSPNet\/decoder\/ResizeBilinear_4:0",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "MobilePSPNet\/decoder\/ResizeBilinear_4:0"
    },
    {
      "bottom" : "MobilePSPNet\/decoder\/ResizeBilinear_4:0",
      "scaling_factor_y" : 2,
      "weights" : {
      },
      "mode" : 1,
      "top" : "MobilePSPNet\/decoder\/ResizeBilinear_5:0",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "MobilePSPNet\/decoder\/ResizeBilinear_5:0"
    },
    {
      "bottom" : "MobilePSPNet\/decoder\/ResizeBilinear_5:0",
      "scaling_factor_y" : 2,
      "weights" : {
      },
      "mode" : 1,
      "top" : "MobilePSPNet\/decoder\/ResizeBilinear_6:0",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "MobilePSPNet\/decoder\/ResizeBilinear_6:0"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 0,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {
      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "MobilePSPNet\/decoder\/avg_pool_2\/AvgPool:0",
      "pad_l" : 0,
      "name" : "MobilePSPNet\/decoder\/avg_pool_3\/AvgPool:0",
      "top" : "MobilePSPNet\/decoder\/avg_pool_3\/AvgPool:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilePSPNet\/decoder\/conv2\/Relu:0",
      "K" : 448,
      "blob_biases" : 213,
      "name" : "MobilePSPNet\/decoder\/conv2\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "MobilePSPNet\/decoder\/avg_pool_3\/AvgPool:0",
      "weights" : {
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 215
    },
    {
      "bottom" : "MobilePSPNet\/decoder\/conv2\/Relu:0",
      "scaling_factor_y" : 2,
      "weights" : {
      },
      "mode" : 1,
      "top" : "MobilePSPNet\/decoder\/ResizeBilinear:0",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "MobilePSPNet\/decoder\/ResizeBilinear:0"
    },
    {
      "bottom" : "MobilePSPNet\/decoder\/ResizeBilinear:0",
      "scaling_factor_y" : 2,
      "weights" : {
      },
      "mode" : 1,
      "top" : "MobilePSPNet\/decoder\/ResizeBilinear_1:0",
